[
  {
    "image": "https://i.ibb.co/hJHC49f9/Eco-Notes.png",
    "title": "Eco Notes",
    "companyName": "GreenPixel Labs",
    "id": 101,
    "description": "Eco Notes is a minimalist note-taking app designed for sustainability-conscious users. It features offline access, dark mode, and cloud sync with zero carbon footprint. The app uses AI-powered organization to automatically categorize your notes and offers end-to-end encryption for maximum privacy. Perfect for students, professionals, and environmental advocates. With its intuitive interface and seamless cross-device synchronization, you can capture ideas anywhere and access them everywhere. The app also includes collaborative features for team projects and supports rich media attachments including images, audio recordings, and handwritten notes. Our commitment to sustainability extends to our servers running on renewable energy and our partnership with environmental organizations.",
    "size": 24.5,
    "reviews": 42,
    "ratingAvg": 4.6,
    "downloads": 12,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 62 },
      { "name": "3 star", "count": 134 },
      { "name": "4 star", "count": 298 },
      { "name": "5 star", "count": 748 }
    ]
  },
  {
    "image": "https://i.ibb.co/XxPVkN6d/Fit-Tracker-Pro.png",
    "title": "FitTracker Pro",
    "companyName": "HealthTech Solutions",
    "id": 102,
    "description": "FitTracker Pro is your ultimate fitness companion with real-time workout tracking and personalized training plans. It integrates with popular smartwatches and offers detailed analytics of your progress. The app includes guided meditation sessions, nutrition planning, and social challenges to keep you motivated. Syncs seamlessly with Apple Health and Google Fit. Track over 50 different activities with precise metrics and receive personalized coaching based on your performance data. The advanced sleep analysis feature helps optimize your recovery, while the meal planner suggests recipes based on your dietary preferences and fitness goals. Join live virtual classes and compete with friends in weekly fitness challenges to stay engaged and accountable on your wellness journey.",
    "size": 87.3,
    "reviews": 33,
    "ratingAvg": 4.8,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 312 },
      { "name": "2 star", "count": 498 },
      { "name": "3 star", "count": 2156 },
      { "name": "4 star", "count": 8542 },
      { "name": "5 star", "count": 13923 }
    ]
  },
  {
    "image": "https://i.ibb.co/7Jy6yHz1/Budget-Buddy.png",
    "title": "Budget Buddy",
    "companyName": "FinanceWise Inc",
    "id": 103,
    "description": "Budget Buddy helps you take control of your finances with intuitive expense tracking and smart budgeting tools. It automatically categorizes your transactions and provides detailed spending reports. The app features bill reminders, savings goals, and investment tracking. Bank-level security ensures your financial data remains completely safe and private. Our AI-powered insights identify spending patterns and suggest optimizations to help you save more money each month. Set up custom budget categories and receive alerts when you're approaching your limits. The net worth tracker gives you a comprehensive view of your financial health, while the debt payoff planner helps you create effective strategies to become debt-free faster. Export detailed reports for tax purposes and connect unlimited bank accounts for complete financial oversight.",
    "size": 45.2,
    "reviews": 51,
    "ratingAvg": 4.5,
    "downloads": 14,
    "ratings": [
      { "name": "1 star", "count": 156 },
      { "name": "2 star", "count": 287 },
      { "name": "3 star", "count": 1245 },
      { "name": "4 star", "count": 3256 },
      { "name": "5 star", "count": 3979 }
    ]
  },
  {
    "image": "https://i.ibb.co/hJbpK706/Recipe-Master.png",
    "title": "Recipe Master",
    "companyName": "Culinary Arts Digital",
    "id": 104,
    "description": "Recipe Master brings thousands of chef-curated recipes to your kitchen with step-by-step video instructions. Create shopping lists directly from recipes and discover meals based on ingredients you already have. The app includes dietary filters, cooking timers, and nutritional information. Perfect for both beginner cooks and experienced chefs. Our advanced meal planner automatically generates weekly menus based on your preferences and schedules ingredients for efficient grocery shopping. The cooking academy section offers masterclasses from world-renowned chefs, teaching techniques from basic knife skills to advanced culinary methods. Share your culinary creations with our vibrant community and get feedback from fellow food enthusiasts. The app also features wine pairing suggestions, seasonal ingredient highlights, and the ability to convert measurements between different systems instantly.",
    "size": 156.8,
    "reviews": 28,
    "ratingAvg": 4.7,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 234 },
      { "name": "2 star", "count": 345 },
      { "name": "3 star", "count": 1567 },
      { "name": "4 star", "count": 5234 },
      { "name": "5 star", "count": 8298 }
    ]
  },
  {
    "image": "https://i.ibb.co/ymKHs69z/Sleep-Sounds.png",
    "title": "Sleep Sounds",
    "companyName": "Mindful Moments LLC",
    "id": 105,
    "description": "Sleep Sounds offers a vast library of calming sounds and guided sleep meditations to help you fall asleep faster and sleep deeper. Features include customizable sound mixes, smart alarm that wakes you during light sleep, and sleep tracking. The app also provides sleep stories narrated by professional voice actors and breathing exercises. Our advanced sleep analysis uses soothing sounds and proven techniques to improve your sleep quality over time. Create perfect soundscapes by mixing different nature sounds, white noise, and ambient tones. The bedtime reminder feature helps establish consistent sleep routines, while the sleep diary allows you to track factors affecting your rest. Premium subscribers get access to exclusive content including celebrity-narrated sleep stories and personalized sleep coaching programs designed by sleep specialists.",
    "size": 32.1,
    "reviews": 47,
    "ratingAvg": 4.9,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 128 },
      { "name": "2 star", "count": 256 },
      { "name": "3 star", "count": 987 },
      { "name": "4 star", "count": 8567 },
      { "name": "5 star", "count": 24277 }
    ]
  },
  {
    "image": "https://i.ibb.co/DP6Jhs8q/Lang-Learn.png",
    "title": "LangLearn",
    "companyName": "Global Education Tech",
    "id": 106,
    "description": "LangLearn makes language learning fun and effective with interactive lessons and native speaker audio. Practice speaking with AI-powered conversation partners and get instant feedback on pronunciation. The app includes vocabulary games, cultural notes, and progress tracking. Learn Spanish, French, Japanese, and 20+ other languages at your own pace. Our spaced repetition system ensures you remember vocabulary long-term, while the immersive stories and dialogues help you understand context and usage. Connect with native speakers through our language exchange community and participate in weekly challenges to test your skills. The business language courses are perfect for professionals, and the travel phrases section prepares you for real-world conversations. Advanced learners can access literature and news articles in their target language with built-in translation support.",
    "size": 189.4,
    "reviews": 36,
    "ratingAvg": 4.6,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 567 },
      { "name": "2 star", "count": 1234 },
      { "name": "3 star", "count": 7890 },
      { "name": "4 star", "count": 21567 },
      { "name": "5 star", "count": 36587 }
    ]
  },
  {
    "image": "https://i.ibb.co/SXR4D8DD/Plant-Care-Guide.png",
    "title": "Plant Care Guide",
    "companyName": "Garden Tech Innovations",
    "id": 107,
    "description": "Plant Care Guide helps you keep your plants thriving with personalized care reminders and plant identification. Take a photo of any plant to get detailed care instructions and diagnose problems. The app includes watering schedules, fertilizer tracking, and a community of plant lovers. Perfect for both indoor houseplants and outdoor gardens. Our extensive plant database contains information on over 50,000 species with specific care requirements for different climates and seasons. The disease identification feature helps detect common plant issues early, while the seasonal care calendar ensures your plants get the right attention year-round. Connect with local gardeners to exchange tips and plants, and participate in monthly gardening challenges. The app also features garden planning tools, pest control solutions, and detailed guides on propagation techniques to help expand your plant collection.",
    "size": 76.3,
    "reviews": 54,
    "ratingAvg": 4.4,
    "downloads": 15,
    "ratings": [
      { "name": "1 star", "count": 345 },
      { "name": "2 star", "count": 567 },
      { "name": "3 star", "count": 2345 },
      { "name": "4 star", "count": 4567 },
      { "name": "5 star", "count": 4521 }
    ]
  },
  {
    "image": "https://i.ibb.co/Kj3KSXFF/Travel-Planner-Pro.png",
    "title": "Travel Planner Pro",
    "companyName": "Wanderlust Digital",
    "id": 108,
    "description": "Travel Planner Pro simplifies trip planning with itinerary creation, budget tracking, and destination guides. Get real-time flight status updates and weather forecasts for your destinations. The app offers offline maps, currency conversion, and local emergency information. Share your travel plans with friends and family for added safety. Our AI travel assistant suggests optimal routes and hidden gems based on your interests and travel style. The packing list generator ensures you never forget essentials, while the expense tracker helps you stay within budget. Access exclusive deals on accommodations and activities through our partner network. The collaborative planning feature allows multiple travelers to contribute to the itinerary, and the digital scrapbook lets you preserve memories with photos and notes from your journey. Real-time alerts keep you informed about travel advisories and local events.",
    "size": 134.7,
    "reviews": 29,
    "ratingAvg": 4.7,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 234 },
      { "name": "2 star", "count": 456 },
      { "name": "3 star", "count": 2876 },
      { "name": "4 star", "count": 9567 },
      { "name": "5 star", "count": 15632 }
    ]
  },
  {
    "image": "https://i.ibb.co/JWmkDxHL/Photo-Editor-Plus.png",
    "title": "Photo Editor Plus",
    "companyName": "Creative Vision Studios",
    "id": 109,
    "description": "Photo Editor Plus offers professional-grade editing tools in a user-friendly mobile app. Features include advanced filters, AI-powered background removal, and collage maker with hundreds of templates. The app supports RAW file editing and offers non-destructive editing. Perfect for social media content creators and photography enthusiasts. Our AI enhancement tools automatically improve lighting and colors, while the selective editing features allow precise adjustments to specific areas of your images. Create stunning double exposures and artistic effects with our advanced blending modes. The batch processing feature saves time when editing multiple photos, and the preset system lets you save your favorite editing combinations. Export in multiple formats and resolutions optimized for different social media platforms. The learning center provides tutorials from professional photographers to help you master editing techniques and develop your unique style.",
    "size": 245.6,
    "reviews": 45,
    "ratingAvg": 4.5,
    "downloads": 13,
    "ratings": [
      { "name": "1 star", "count": 678 },
      { "name": "2 star", "count": 1234 },
      { "name": "3 star", "count": 5678 },
      { "name": "4 star", "count": 15678 },
      { "name": "5 star", "count": 22410 }
    ]
  },
  {
    "image": "https://i.ibb.co/nq717SMk/Mindful-Moments.png",
    "title": "Mindful Moments",
    "companyName": "ZenTech Solutions",
    "id": 110,
    "description": "Mindful Moments provides daily meditation practices and mindfulness exercises for stress reduction and mental clarity. Choose from hundreds of guided sessions ranging from 3 to 60 minutes. The app includes mood tracking, progress insights, and personalized recommendations. Suitable for beginners and experienced meditators alike. Our specialized programs address specific needs like anxiety reduction, better sleep, focus improvement, and emotional balance. The breathing exercises help regulate your nervous system, while the body scan meditations promote deep relaxation. Track your meditation streak and earn achievements to stay motivated. The community features allow you to connect with like-minded individuals and join group meditation sessions. Professional therapists and mindfulness experts regularly contribute new content, ensuring you have access to the latest techniques and approaches for mental wellbeing and personal growth.",
    "size": 54.2,
    "reviews": 38,
    "ratingAvg": 4.8,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 123 },
      { "name": "2 star", "count": 234 },
      { "name": "3 star", "count": 1567 },
      { "name": "4 star", "count": 9876 },
      { "name": "5 star", "count": 22767 }
    ]
  },
  {
    "image": "https://i.ibb.co/BKgjWXf6/Weather-Radar-Pro.png",
    "title": "Weather Radar Pro",
    "companyName": "Climate Data Systems",
    "id": 111,
    "description": "Weather Radar Pro delivers hyper-local weather forecasts with stunning radar animations and severe weather alerts. Get minute-by-minute precipitation forecasts and extended 15-day outlooks. The app features customizable widgets, hurricane tracking, and ski condition reports. Essential for outdoor enthusiasts, travelers, and weather buffs. Our advanced modeling provides air quality indexes, pollen counts, and UV indexes to help you plan your activities safely. The historical weather data helps you understand climate patterns, while the agricultural features assist farmers with planting and harvesting decisions. Set up custom alerts for specific weather conditions like temperature thresholds, wind speeds, or precipitation amounts. The professional version includes lightning detection, storm cell analysis, and advanced meteorological data used by emergency services and outdoor event planners. Share weather reports with friends and access detailed marine forecasts for boating and fishing.",
    "size": 98.5,
    "reviews": 52,
    "ratingAvg": 4.3,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 456 },
      { "name": "2 star", "count": 789 },
      { "name": "3 star", "count": 3456 },
      { "name": "4 star", "count": 8567 },
      { "name": "5 star", "count": 10188 }
    ]
  },
  {
    "image": "https://i.ibb.co/ccJGkZkG/Mobile-Music-Studio.png",
    "title": "Mobile Music Studio",
    "companyName": "Audio Innovations Co",
    "id": 112,
    "description": "Mobile Music Studio turns your device into a professional recording studio with multi-track recording and virtual instruments. Create music anywhere with built-in synthesizers, drum machines, and guitar effects. The app supports MIDI controllers and offers high-quality audio export. Perfect for musicians, podcasters, and audio creators on the go. Our extensive sound library includes thousands of royalty-free samples and loops across all genres. The mastering suite helps you polish your tracks to professional standards, while the collaboration features allow real-time remote recording sessions with other musicians. The chord progression generator and scale helpers assist songwriters in creating compelling musical ideas. Export your projects in multiple formats including WAV, MP3, and directly to streaming platforms. Regular updates bring new instruments, effects, and features based on user feedback and the latest audio technology advancements.",
    "size": 312.8,
    "reviews": 31,
    "ratingAvg": 4.6,
    "downloads": 12,
    "ratings": [
      { "name": "1 star", "count": 234 },
      { "name": "2 star", "count": 345 },
      { "name": "3 star", "count": 2345 },
      { "name": "4 star", "count": 5678 },
      { "name": "5 star", "count": 7071 }
    ]
  },
  {
    "image": "https://i.ibb.co/prdgv5bj/Book-Worm-Reader.png",
    "title": "BookWorm Reader",
    "companyName": "Digital Pages Inc",
    "id": 113,
    "description": "BookWorm Reader offers a comfortable reading experience with customizable fonts, themes, and reading progress tracking. Access thousands of free classics and sync your reading position across devices. The app includes dictionary lookup, highlighting, and note-taking features. Join reading challenges and discover new books through personalized recommendations. Our advanced text-to-speech feature lets you listen to books with natural-sounding voices, perfect for commuting or multitasking. The social reading features allow you to see friends' highlights and share your insights. Create virtual bookshelves to organize your library and set reading goals to develop consistent habits. The book club feature helps you coordinate group readings and discussions. Premium subscribers get access to exclusive content from contemporary authors and early releases of popular titles. Our algorithm learns your preferences to suggest books you'll love from our massive catalog of millions of titles.",
    "size": 67.9,
    "reviews": 49,
    "ratingAvg": 4.7,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 321 },
      { "name": "2 star", "count": 543 },
      { "name": "3 star", "count": 3456 },
      { "name": "4 star", "count": 15678 },
      { "name": "5 star", "count": 23212 }
    ]
  },
  {
    "image": "https://i.ibb.co/tPB3dzqC/Home-Workout-Coach.png",
    "title": "Home Workout Coach",
    "companyName": "Fitness Everywhere",
    "id": 114,
    "description": "Home Workout Coach provides effective exercise routines that require no equipment and minimal space. Follow along with HD video demonstrations and audio guidance. The app creates personalized workout plans based on your fitness level and goals. Track your progress, join live classes, and connect with a supportive fitness community. Our certified trainers design new content weekly, ensuring fresh and engaging workouts that target different muscle groups and fitness aspects. The form checker feature uses your device's camera to provide feedback on your exercise technique. The recovery tools include guided cool-downs and stretching routines to prevent injuries. Set specific goals like weight loss, muscle building, or improved flexibility, and the app will adapt your training program accordingly. The achievement system and virtual races keep you motivated, while the nutrition guidance complements your fitness journey with healthy eating recommendations.",
    "size": 143.2,
    "reviews": 26,
    "ratingAvg": 4.8,
    "downloads": 14,
    "ratings": [
      { "name": "1 star", "count": 234 },
      { "name": "2 star", "count": 456 },
      { "name": "3 star", "count": 2345 },
      { "name": "4 star", "count": 15678 },
      { "name": "5 star", "count": 38076 }
    ]
  },
  {
    "image": "https://i.ibb.co/VW8qv931/Splitwise-Pro.png",
    "title": "Splitwise Pro",
    "companyName": "Group Expense Solutions",
    "id": 115,
    "description": "Splitwise Pro makes splitting bills and expenses with friends incredibly easy. Track shared expenses, settle up with integrated payments, and get reminders for owed money. The app handles complex splitting scenarios and currency conversion. Perfect for roommates, travelers, and anyone who shares expenses regularly. Our smart settlement feature calculates the minimum number of transactions to settle all debts within a group. The receipt scanning technology automatically extracts amounts and participants from photos of receipts. Create recurring expenses for regular bills and set up approval workflows for group expenses. The expense reports provide detailed breakdowns for tax purposes or budget reviews. Integrated payment options include bank transfers, PayPal, and Venmo for seamless settlements. The trip planning features help groups coordinate shared vacation costs from flights to accommodations, ensuring everyone pays their fair share without awkward conversations.",
    "size": 45.6,
    "reviews": 55,
    "ratingAvg": 4.9,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 89 },
      { "name": "2 star", "count": 123 },
      { "name": "3 star", "count": 987 },
      { "name": "4 star", "count": 8567 },
      { "name": "5 star", "count": 24755 }
    ]
  },
  {
    "image": "https://i.ibb.co/1Yrf6WTr/Kids-Learning-World.png",
    "title": "Kids Learning World",
    "companyName": "Educational Fun Co",
    "id": 116,
    "description": "Kids Learning World offers educational games and activities for children ages 2-8. Developed with child psychologists and educators, the app covers reading, math, science, and creativity. Features include progress tracking for parents, ad-free environment, and offline access. Safe, engaging, and designed to make learning fun for young children. Our adaptive learning path automatically adjusts difficulty based on each child's progress, ensuring they're always appropriately challenged. The creative studio encourages artistic expression with drawing tools, music makers, and storytelling features. Parents receive detailed reports on their child's development and can set learning goals and time limits. The multiplayer educational games promote social skills while reinforcing academic concepts. Regular content updates introduce new themes and activities aligned with seasonal events and current educational standards. The app works seamlessly across multiple devices, allowing children to continue their learning journey anywhere.",
    "size": 287.4,
    "reviews": 37,
    "ratingAvg": 4.7,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 123 },
      { "name": "2 star", "count": 234 },
      { "name": "3 star", "count": 1567 },
      { "name": "4 star", "count": 8567 },
      { "name": "5 star", "count": 12965 }
    ]
  },
  {
    "image": "https://i.ibb.co/YTppj66z/Code-Companion.jpg",
    "title": "Code Companion",
    "companyName": "DevTools Technologies",
    "id": 117,
    "description": "Code Companion is the ultimate mobile coding assistant for developers on the go. Features include syntax highlighting for 50+ programming languages, code compilation in the cloud, and real-time collaboration. The app offers GitHub integration, code snippets library, and debugging tools. Perfect for learning new languages, quick code reviews, or emergency fixes when away from your desk. Our AI-powered code completion suggests optimal solutions while the interactive tutorials help you master new frameworks and technologies. The terminal emulator provides SSH access to remote servers, and the database browser allows you to query and manage databases directly from your mobile device. Regular coding challenges and hackathons keep your skills sharp, and the developer community forum provides instant help and code reviews from peers around the world.",
    "size": 89.6,
    "reviews": 43,
    "ratingAvg": 4.5,
    "downloads": 16,
    "ratings": [
      { "name": "1 star", "count": 167 },
      { "name": "2 star", "count": 289 },
      { "name": "3 star", "count": 1456 },
      { "name": "4 star", "count": 4234 },
      { "name": "5 star", "count": 5678 }
    ]
  },
  {
    "image": "https://i.ibb.co/xK4t6FBN/Star-Gazer.jpg",
    "title": "Star Gazer",
    "companyName": "Cosmic Explorations Ltd",
    "id": 118,
    "description": "Star Gazer transforms your device into a personal planetarium with augmented reality star mapping. Simply point your camera at the sky to identify stars, planets, constellations, and satellites in real-time. The app includes meteor shower alerts, eclipse tracking, and space news updates. Perfect for astronomy enthusiasts, educators, and romantic stargazers. Our extensive database contains over 1.5 million celestial objects with detailed information and mythology stories. The night mode preserves your dark adaptation with red lighting, while the time travel feature lets you see how the sky looked in the past or will look in the future. Join live virtual telescope sessions and participate in citizen science projects like asteroid tracking and exoplanet discovery. The social features allow you to share your astronomical observations and join local stargazing groups for real-world observing sessions.",
    "size": 234.1,
    "reviews": 32,
    "ratingAvg": 4.8,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 89 },
      { "name": "2 star", "count": 134 },
      { "name": "3 star", "count": 567 },
      { "name": "4 star", "count": 2345 },
      { "name": "5 star", "count": 8123 }
    ]
  },
  {
    "image": "https://i.ibb.co/S7ZW3cCB/Pet-Care-Assistant.jpg",
    "title": "Pet Care Assistant",
    "companyName": "Animal Wellness Tech",
    "id": 119,
    "description": "Pet Care Assistant helps you provide the best care for your furry friends with vaccination reminders, health tracking, and vet appointment scheduling. The app includes symptom checker, medication tracker, and emergency first aid guides. Connect with licensed veterinarians for virtual consultations and get personalized advice for your pet's specific needs. Our behavior training section offers step-by-step guides for common issues, while the nutrition planner helps you create balanced meals based on your pet's age, breed, and health conditions. The lost pet alert system quickly notifies local shelters and community members if your pet goes missing. Track your pet's growth, weight, and activity levels with our integrated charts and receive alerts for potential health issues. The social features let you share adorable photos, join breed-specific communities, and find pet-friendly places in your area.",
    "size": 76.8,
    "reviews": 58,
    "ratingAvg": 4.6,
    "downloads": 13,
    "ratings": [
      { "name": "1 star", "count": 234 },
      { "name": "2 star", "count": 345 },
      { "name": "3 star", "count": 1234 },
      { "name": "4 star", "count": 4567 },
      { "name": "5 star", "count": 7890 }
    ]
  },
  {
    "image": "https://i.ibb.co/8gWtnpcj/DIY-Home-Pro.jpg",
    "title": "DIY Home Pro",
    "companyName": "Home Improvement Labs",
    "id": 120,
    "description": "DIY Home Pro empowers homeowners with step-by-step guides for home improvement projects, repair tutorials, and maintenance schedules. Use augmented reality to visualize furniture in your space before buying and get accurate measurements with your camera. The app includes cost calculators, material lists, and professional tips for every skill level. Our extensive video library covers everything from basic plumbing repairs to advanced woodworking projects. The project planner helps you break down complex renovations into manageable steps with realistic timelines. Connect with local professionals for consultations or hire help for specific tasks through our verified contractor network. The inspiration gallery features thousands of completed projects with detailed breakdowns of materials and costs. The safety section ensures you understand proper tool usage and protective equipment for each project, making home improvement accessible and safe for everyone.",
    "size": 187.3,
    "reviews": 41,
    "ratingAvg": 4.4,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 345 },
      { "name": "2 star", "count": 567 },
      { "name": "3 star", "count": 2345 },
      { "name": "4 star", "count": 5678 },
      { "name": "5 star", "count": 6789 }
    ]
  }
]
